Repository: lisan1-net/student_blogs
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ar

source: Indexes
ar: الفهارس

source: Index bigrams from the indexed words of the blog texts
ar: فهرسة المتلازمات اللفظية الثنائية من الكلمات المفهرسة لنصوص المدونة

source: Blog IDs to index words
ar: معرفات المدونات لفهرسة الكلمات

source: Clear all indexed words
ar: مسح جميع الكلمات المفهرسة

source: Maximum number of texts to index bigrams
ar: أقصى عدد من النصوص لفهرسة المتلازمات اللفظية الثنائية

source: Clearing all indexed bigrams...
ar: جارٍ مسح جميع المتلازمات اللفظية الثنائية المفهرسة...

source: Blog with ID %(id)d does not exist
ar: المدونة ذات المعرف %(id)d غير موجودة

source: Number of texts that will be indexed: %(count)d
ar: عدد النصوص التي ستتم فهرستها: %(count)d

source: Indexed %(bigram)s
ar: تمت فهرسة %(bigram)s

source: Bigram "%(word1)s %(word2)s" already exists
ar: المتلازمة اللفظية الثنائية "%(word1)s %(word2)s" موجودة بالفعل

source: Finished indexing bigrams
ar: تمت فهرسة المتلازمات اللفظية الثنائية

source: Index trigrams from the indexed words of the blog texts
ar: فهرسة المتلازمات اللفظية الثلاثية من الكلمات المفهرسة لنصوص المدونة

source: Clearing all indexed trigrams...
ar: جارٍ مسح جميع المتلازمات اللفظية الثلاثية المفهرسة...

source: Indexed %(trigram)s
ar: تمت فهرسة %(trigram)s

source: Trigram "%(word1)s %(word2)s %(word3)s" already exists
ar: المتلازمة اللفظية الثلاثية "%(word1)s %(word2)s %(word3)s" موجودة بالفعل

source: Finished indexing trigrams
ar: تمت فهرسة المتلازمات اللفظية الثلاثية

source: Index words of the blog texts
ar: فهرسة كلمات نصوص المدونة

source: Maximum number of texts to index words
ar: أقصى عدد من النصوص لفهرسة الكلمات

source: Clearing all indexed text words...
ar: جارٍ مسح جميع كلمات النص المفهرسة...

source: Indexing words of "%(text)s"...
ar: جارٍ فهرسة كلمات "%(text)s"...

source: Initial indexing progress: %(current)d/%(max)d
ar: التقدم الأولي للفهرسة: %(current)d/%(max)d

source: Indexing "%(token)s" [%(start)d:%(end)d]
ar: جارٍ فهرسة "%(token)s" [%(start)d:%(end)d]

source: Failed to index "%(token)s"
ar: فشلت فهرسة "%(token)s"

source: Finished indexing words
ar: تمت فهرسة الكلمات

source: Token
ar: الوحدة

source: Tokens
ar: الوحدات

source: Content
ar: المحتوى

source: Content of the token
ar: محتوى الوحدة

source: Texts
ar: النصوص

source: Texts that contain this token
ar: النصوص التي تحتوي على هذه الوحدة

source: Text Token
ar: وحدة النص

source: Text Tokens
ar: وحدات النص

source: Text
ar: النص

source: Text that contains this token
ar: النص الذي يحتوي على هذه الوحدة

source: Token that is found in this text
ar: الوحدة الموجودة في هذا النص

source: Start
ar: البداية

source: Start position of the token in the text
ar: بداية الوحدة في النص

source: End
ar: النهاية

source: End position of the token in the text
ar: نهاية الوحدة في النص

source: "%(token)s" in "%(text)s" [%(start)d:%(end)d]
ar: "%(token)s" في "%(text)s" [%(start)d:%(end)d]

source: Bigram
ar: المتلازمة اللفظية الثنائية

source: Bigrams
ar: المتلازمات اللفظية الثنائية

source: First Token
ar: الوحدة الأولى

source: First token of the bigram
ar: الوحدة الأولى من المتلازمة اللفظية الثنائية

source: Second Token
ar: الوحدة الثانية

source: Second token of the bigram
ar: الوحدة الثانية من المتلازمة اللفظية الثنائية

source: Text that contains this bigram
ar: النص الذي يحتوي على هذه المتلازمة اللفظية الثنائية

source: Frequency
ar: التكرار

source: Number of occurrences of the bigram in the text
ar: عدد حدوثات المتلازمة اللفظية الثنائية في النص

source: "%(first)s %(second)s" in "%(text)s"
ar: "%(first)s %(second)s" في "%(text)s"

source: Trigram
ar: المتلازمة اللفظية الثلاثية

source: Trigrams
ar: المتلازمات اللفظية الثلاثية

source: First token of the trigram
ar: الوحدة الأولى من المتلازمة اللفظية الثلاثية

source: Second token of the trigram
ar: الوحدة الثانية من المتلازمة اللفظية الثلاثية

source: Third Token
ar: الوحدة الثالثة

source: Third token of the trigram
ar: الوحدة الثالثة من المتلازمة اللفظية الثلاثية

source: Text that contains this trigram
ar: النص الذي يحتوي على هذه المتلازمة اللفظية الثلاثية

source: Number of occurrences of the trigram in the text
ar: عدد حدوثات المتلازمة اللفظية الثلاثية في النص

source: "%(first)s %(second)s %(third)s" in "%(text)s"
ar: "%(first)s %(second)s %(third)s" في "%(text)s"

source: Unspecified
ar: غير محدد

source: %(count)d text moved to "%(blog)s".
ar: %(count)d من النصوص تم نقله إلى "%(blog)s".

source: Move to "%s"
ar: نقل إلى "%s"

source: Students blog
ar: مدونة الطلاب

source: Search query
ar: استعلام البحث

source: Enter an expression to search in the texts. Any expression in double quotes will be searched as a whole word.
ar: أدخل تعبيرًا للبحث في النصوص. أي تعبير بين علامتي اقتباس مزدوجة سيتم البحث عنه ككلمة كاملة.

source: Tags
ar: الوسوم

source: Select the tags of the text.
ar: حدد الوسوم الخاصة بالنص.

source: Export count
ar: عدد التصدير

source: The maximum number of results to export.
ar: أقصى عدد من النتائج لتصديرها.

source: The blog to search in
ar: حدد مدونة للبحث فيها

source: Include functional words
ar: تضمين الكلمات الوظيفية

source: Include the functional words in the search results.
ar: تضمين الكلمات الوظيفية ('في'، 'على'، 'من'، ...) في نتائج البحث.

source: Contains
ar: يحوي

source: Enter a word or a part of it to search for.
ar: أدخل كلمة أو جزء منها للبحث.

source: Partial contains
ar: محتوى جزئي للتضمين

source: Search for a part of the word.
ar: البحث عن جزء من الكلمة.

source: Does not contain
ar: لا يحوي

source: Enter a word part of it to exclude from the search results.
ar: أدخل كلمة أو جزء منها لاستبعاده من نتائج البحث.

source: Partial does not contain
ar: محتوى جزئي للاستبعاد

source: Exclude a part of the word.
ar: استبعاد جزء من الكلمة.

source: Select a blog
ar: حدد مدونة

source: N-gram type
ar: نوع المتلازمة اللفظية

source: Select the type of n-gram to search for.
ar: حدد نوع المتلازمة اللفظية للبحث عنها.

source: Blogs
ar: المدونات

source: Select the blogs to compare.
ar: حدد المدونات للمقارنة.

source: Previous words
ar: الكلمات السابقة

source: Next words
ar: الكلمات التالية

source: Position
ar: الموضع

source: Select the position of the words to search for.
ar: حدد الموضع للكلمات التي تبحث عنها.

source: Partial search
ar: بحث جزئي

source: Enter a word or part of it to search for its previous and next words.
ar: أدخل كلمة أو جزء منها للبحث عن كلماتها السابقة والتالية.

source: Enter a word to search for its derivations (by adding the possible prefixes and suffixes).
ar: أدخل كلمة للبحث عن اشتقاقاتها (من خلال إضافة السوابق واللواحق الممكنة).

source: Blog
ar: المدونة

source: Title
ar: العنوان

source: Blog title
ar: عنوان المدونة

source: Description
ar: الوصف

source: Blog description
ar: وصف المدونة

source: Words: %(words)d, Unique words: %(unique)d
ar: الكلمات: %(words)d، الكلمات بدون تكرار: %(unique)d

source: Spoken
ar: منطوق

source: Written
ar: مكتوب

source: Notebooks
ar: كراسات

source: Male
ar: ذكر

source: Female
ar: أنثى

source: Blog that contains this text
ar: المدونة التي تحتوي على هذا النص

source: Title of the text
ar: عنوان النص

source: Content of the text
ar: محتوى النص

source: Type
ar: النوع

source: Type of the text
ar: نوع النص

source: Number
ar: الرقم

source: Number of the student
ar: رقم الطالب

source: Sex
ar: الجنس

source: Student sex
ar: جنس الطالب

source: Level
ar: الصف

source: Level of the student
ar: صف الطالب

source: School
ar: المدرسة

source: School of the student
ar: مدرسة الطالب

source: City
ar: المدينة

source: City of the student
ar: مدينة الطالب

source: Source
ar: المصدر

source: Source type
ar: نوع المصدر

source: Added on
ar: أضيف في

source: Date and time of adding the text to the database
ar: تاريخ ووقت إضافة النص إلى قاعدة البيانات

source: Last updated on
ar: آخر تحديث في

source: Date and time of the last update of the text in the database
ar: تاريخ ووقت آخر تحديث للنص في قاعدة البيانات

source: Words indexed
ar: الكلمات مفهرسة

source: Indicates whether the words of this text are indexed or not
ar: يشير إلى ما إذا كانت كلمات هذا النص مفهرسة أم لا

source: Bigrams indexed
ar: المتلازمات اللفظية الثنائية مفهرسة

source: Indicates whether the bigrams of this text are indexed or not
ar: يشير إلى ما إذا كانت المتلازمات اللفظية الثنائية لهذا النص مفهرسة أم لا

source: Trigrams indexed
ar: المتلازمات اللفظية الثلاثية مفهرسة

source: Indicates whether the trigrams of this text are indexed or not
ar: يشير إلى ما إذا كانت المتلازمات اللفظية الثلاثية لهذا النص مفهرسة أم لا

source: Student number %(number)d
ar: الطالب رقم %(number)d

# Male
source: Student number %(number)d
ar: الطالب رقم %(number)d

# Female
source: Student number %(number)d
ar: الطالبة رقم %(number)d

source: Level %(level)d
ar: الصف %(level)d

source: Functional Word
ar: الكلمة الوظيفية

source: Functional Words
ar: الكلمات الوظيفية

source: Content of the functional word
ar: محتوى الكلمة الوظيفية

source: Announcement
ar: الإعلان

source: Announcements
ar: الإعلانات

source: Title of the announcement
ar: عنوان الإعلان

source: Description of the announcement
ar: وصف الإعلان

source: Image link
ar: رابط الصورة

source: Link to the image of the announcement
ar: رابط صورة الإعلان

source: Link
ar: الرابط

source: Link to the announcement
ar: رابط الإعلان

source: Date and time of adding the announcement
ar: تاريخ ووقت إضافة الإعلان

source: Active
ar: نشط

source: Indicates whether the announcement is shown or not
ar: يشير إلى ما إذا كان الإعلان معروضًا أم لا

source: Dictionary Definition
ar: تعريف المعجم

source: Dictionary Definitions
ar: تعاريف المعجم

source: Term
ar: المصطلح

source: Term in the dictionary
ar: المصطلح في المعجم

source: Definition
ar: التعريف

source: Definition of the term
ar: تعريف المصطلح

source: Prefix
ar: السابقة

source: Prefixes
ar: السوابق

source: Content of the prefix
ar: محتوى السابقة

source: Compatible with suffixes
ar: متوافقة مع اللواحق

source: Suffix
ar: اللاحقة

source: Suffixes
ar: اللواحق

source: Content of the suffix
ar: محتوى اللاحقة

source: Copyright 2024. All rights reserved. Dr. Abdulaziz Abdullah Almhyubi
ar: حقوق النشر 2024. جميع الحقوق محفوظة. د. عبد العزيز عبد الله المهيوبي

source: Search engine in the blogs of students
ar: محرك بحث في مدونات الطلاب

source: search, blogs, students
ar: بحث، مدونات، طلاب

# Navbar
source: Search
ar: البحث

source: Vocabulary
ar: شيوع الألفاظ

source: N-grams
ar: المتلازمات اللفظية

source: Blog comparison
ar: مقارنة المدونات

source: Surrounding words
ar: الكلمات المحيطة

source: Word derivations
ar: اشتقاقات الكلمة

source: Logout
ar: تسجيل الخروج

source: Login
ar: تسجيل الدخول

source: Search in progress
ar: البحث جارٍ

source: An error occurred
ar: حدث خطأ

source: An error occurred while processing the search query.
ar: حدث خطأ أثناء معالجة استعلام البحث.

source: More details
ar: المزيد من التفاصيل

source: Show details
ar: إظهار التفاصيل

source: Words with duplication
ar: الكلمات بالتكرار

source: Words without duplication
ar: الكلمات بدون تكرار

source: Schools
ar: المدارس

source: Students
ar: الطلاب

source: No students
ar: لا يوجد طلاب

source: Most frequent words
ar: الكلمات الأكثر شيوعًا

source: No words
ar: لا توجد كلمات

source: Show vocabulary
ar: عرض شيوع الألفاظ

source: Export results as Excel file
ar: تصدير النتائج كملف Excel

source: Export results
ar: تصدير النتائج

source: Cancel
ar: إلغاء

source: Export
ar: تصدير

source: ٍSearch pages
ar: صفحات البحث

source: Loading...
ar: جارٍ التحميل...

source: Text information
ar: معلومات النص

source: Student blog options
ar: خيارات مدونة الطلاب

source: Books and stories blog options
ar: خيارات مدونات الكتب والقصص

source: No tags found
ar: لم يتم العثور على وسوم

source: Compare the selected blogs by the most frequent words and ngrams.
ar: قارن المدونات المحددة بالكلمات والمتلازمات اللفظية الأكثر شيوعًا.

source: Compare
ar: قارن

source: No results
ar: لا توجد نتائج

source: Most frequent bigrams
ar: المتلازمات الثنائية الأكثر شيوعًا

source: Most frequent trigrams
ar: المتلازمات الثلاثية الأكثر شيوعًا

source: Search for the words that are derived from the given word in the texts with their apparition frequencies.
ar: البحث عن الكلمات المشتقة من الكلمة المعطاة في النصوص مع تكرارات ظهورها.

source: No words found
ar: لم يتم العثور على أيّة ألفاظ

source: Extraction of the n-grams
ar: استخراج المتلازمات اللفظية

source: Extract the n-grams from the texts with their apparition ratios.
ar: استخراج المتلازمات اللفظية من النصوص مع نسب ظهورها.

source: No N-grams found
ar: لم يتم العثور على متلازمات لفظية

source: Search in the database
ar: البحث في قاعدة البيانات

source: Available blogs
ar: المدونات المتاحة

source: An error occurred while loading the blog cards.
ar: حدث خطأ أثناء تحميل بطاقات المدونات.

# Form action
source: Search
ar: ابحث

source: Advanced search
ar: بحث متقدم

source: Search results
ar: نتائج البحث

source: Expression frequency
ar: تكرار العبارة

source: Matched documents
ar: المستندات المطابقة

source: Current page
ar: الصفحة الحالية

source: Results from %(f)s to %(t)s of %(c)s
ar: النتائج من %(f)s إلى %(t)s من أصل %(c)s

source: Query did not match any texts.
ar: الاستعلام لم يطابق أية نصوص.

source: Search box
ar: صندوق البحث

source: Search in student blogs
ar: البحث في مدونات الطلاب

source: Enter an expression
ar: أدخل تعبيرًا

source: Search for the previous and following words of a given words in the texts with their apparition frequencies.
ar: البحث عن الكلمات السابقة والتالية للكلمة المعينة في النصوص مع تكرارات ظهورها.

source: Appearance ratio in the texts
ar: نسبة الظهور في النصوص

source: Failed to calculate the appearance ratio
ar: فشل حساب نسبة الظهور

source: Vocabulary of the database
ar: شيوع الألفاظ في المدونات

source: Search for the most frequent vocabulary with the respective frequencies and appearance ratios in the texts.
ar: البحث عن الألفاظ الأكثر شيوعًا مع التكرارات ونسب الظهور في النصوص.

source: Advanced options
ar: خيارات متقدمة

source: Reset password
ar: إعادة تعيين كلمة المرور

source: Context
ar: السياق

source: Student number
ar: رقم الطالب

source: Word
ar: الكلمة

source: Vocabulary results
ar: نتائج شيوع الألفاظ

source: Surrounding words results
ar: نتائج الكلمات المحيطة

source: Word derivations results
ar: نتائج اشتقاقات الكلمة
